from transformers import pipeline

text = """
ספר "כתבי בעל הסולם", "כתבי הדור האחרון", עמ' 848

חלק ג', קטע ב', כותרת "העקרון הדתי, מתוך שלא לשמה בא לשמה"

קריין: ספר "כתבי בעל הסולם", עמ' 848, "כתבי הדור האחרון", חלק ג', קטע ב', כותרת: "העקרון הדתי, מתוך שלא לשמה בא לשמה".

העקרון הדתי, מתוך שלא לשמה בא לשמה
"והכין ההשגחה הנהגת הבריות בדרך אגואיסטית שבהכרח תביאה לחורבן העולם אם לא יקבלו הדת להשפיע. וע"כ יש בה צורך פרגמטי. ומתוכה בא לשמה."

מהו צורך נפשי
"כמו שלעור לא יושג צבעים ולסריס אהבת המין כן החסר הצורך נפשי א"א לצייר לו הצורך הזה. אמנם צורך מחויב הוא."

מעשה מצות
"מעשה מצות מסוגלים לעשות לו צורך נפשי."

מוסריות נימוס
"מוסריות נימוס פירושה, מדות טובות שלא על מנת לקבל פרס, וללא הכרח חיצוני, רק שמבוסס על אלטרואיסם והרגש אחריות כלפי החברה האנושיות. מושג ע"י חינוך.

אמנם החינוך צריך לדעת הצבור שיפרנס ויקיים ויעמידו אחר יציאתו מרשות החינוך.

ודעת הצבור אינו נמשך מחינוך אלא רק מתועלת הצבור.

ותועלת הצבור נערך רק בפי המדינה הפרטית של אותו הצבור שבהכרח הוא בסתירה לעמים ומדינות אחרות - ואיך יועיל ע"ז חינוך. והראיה כי עוד לא נברא הנימוס ואפי' הדת שיספיק "לבין לאומיות" כי הרציחה והגזילה וכו' שולט בכל חמתם. בלי שום נימוס כל שהוא ואדרבה הרוצח הגדול פטריאט ומנומס יחשב וכהיום לנימוס בין לאומי צריכים."

שאלה: מה האדם רוכש מחינוך ומה הוא רוכש מדעת הציבור?

מהחינוך הוא רוכש יסודות שנותנים לו כיוון, ודעת הציבור כבר מעמידה אותו בצורה מסוימת כלפי החיים, כלפי הציבור, כלפי עצמו, ושניהם משלימים זה את זה.

תלמיד: גם הסביבה היא זאת שמחנכת את האדם?

כן.

תלמיד: אז מה מבדיל בין החינוך ובין דעת הציבור?

מה שהאדם מקבל מהסביבה במהלך החיים, במשך שנים, מייצב אותו בצורה יותר בטוחה ונכונה כך שהציבור מבין אותו והוא מבין את הציבור.

שאלה: הציבור יכול להתחנך דרך דעת הציבור, דרך השפעת הסביבה?

כן.

תלמיד: אז מה זה החינוך הישיר? האם יש חינוך ישיר לאהבת הזולת ויש גם את דעת הציבור שתומכת?

אני מבין שהחינוך הישיר הוא שמלמדים ילדים, ואפילו יותר גדולים בצורה ישירה איך צריכים להתנהג ולמה, ונותנים להם הזדמנויות להתנהגות החדשה.

תלמיד: ומה זו תועלת הציבור?

תועלת הציבור היא שהציבור ירגיש עד כמה יש לו רווח למעלה מהתועלת הפרטית של כל אחד, שכדאי להם להתחבר לפי סגנון מיוחד, כי זה תואם להתפתחות הטבע.

תלמיד: ומי יחליט עבור הציבור? איך תתקבע בציבור דעת כזאת שזה מה שאנחנו רוצים?

אני לא יודע אם בעל הסולם כותב על זה באיזה מקום, אבל בדרך כלל הוא אומר שצריכים לקבוע איזה ארגון, איזה גוש שינהל את העניין.

תלמיד: אני חוזר למה שבעל הסולם כותב באותיות הקודמות, האם בדור האחרון כולם יצטרכו להגיע מלא לשמה לשמה או רק יחידי סגולה שבדור?

לא, בדרך כלל זה כמעט כולם אם לא כולם.

תלמיד: כולם צריכים להגיע ל-לשמה?

כן.

תלמיד: ומה הכוונה שמעשי המצוות מסוגלים לעורר באדם את הצורך הנפשי?

הוא מתכוון למצוות בין אדם לחברו, שאם אדם מתחיל לקיים והסביבה תומכת, אז הוא רואה עד כמה זה מועיל לו להיתקן ולהתאים את עצמו לכוח העליון.

תלמיד: מהו היחס נכון בין פטריוטיות ובין לאומיות? כי רואים שמי שתומך היום בבין לאומיות מאבד את הפטריוטיות.

זה באמת לא ברור, לא מובן וזה משתנה מזמן לזמן. בוא נגיד כך, כדי להקים את המשטרים האלו צריכים קודם כוח לאומי ואחר כך בין לאומי, כך אני חושב.

תלמיד: זאת אומרת, בזמננו עד הדור האחרון כל אחד צריך להתגבש בלאום שלו?

כן.

שאלה: בעל סולם אומר שצריך להגיע לאלטרואיזם והרגש אחריות כלפי החברה האנושית, ומצד שני הוא אומר שהחינוך הוא על פי תועלת הציבור ותועלת הציבור היא לפי המדינה הפרטית, ושבהכרח היא בסתירה לעמים ומדינות אחרות.

כן.

תלמיד: איזו מדינה תסכים לחנך לאלטרואיזם כלפי כל העולם כשבזה היא מאבדת את הייחודית שלה? הרי מדינה מתבססת על בידול, על הפרדה.

אני לא חושב שזה צריך להיות כך. אני חושב שהחינוך צריך להיות בעד העם והמדינה של האדם, ואחר כך, אחרי עוד דור או דורות, יבואו לתיקון העולם הכללי. כך נראה לי.

תלמיד: מה התמריץ שיביא לרצון לתיקון העולם הכללי? אם יש מדינה והכול בסדר בה ולהיפך, היא אפילו מוצלחת יותר מאחרות, מה רע לה?

לא רע לה, רק אם היא לא מקיימת את מה שהיא כבר צריכה לקיים לפי גובה התפתחותה, אז היא תרגיש חיסרון, בכל מיני דברים אחרים, אבל בכל זאת החיסרון צריך להופיע.

תלמיד: מה שבינתיים רואים זה רק חסרון לשלוט על מדינות אחרות.

נכון, בינתיים זה כך.

תלמיד: בעל הסולם מדבר פה על נימוס. מה זה נימוס בין העמים?

שכל עם חייב להראות את עצמו שהוא עוזר לכולם לצאת מהטבע הפרימיטיבי ולעלות בדרגות החיבור.

תלמיד: מה זה אומר בפועל?

עוד לא כל כך חשבתי על זה, כי זה עוד רחוק.

תלמיד: היום אנחנו רואים שיש מסחר בין העמים ולכל עם יש את הייחודיות שלו והוא תורם אותה מתוך זה שהוא רוצה להרוויח מזה.

כן.

תלמיד: לעם אחד יש יותר נפט, אז הוא מוכר אותו כי הוא מרוויח מזה כסף ועם הכסף הוא עושה משהו. לעם אחר יש טכנולוגיה, אז הוא מוכר אותה. כלומר יש קשר בין העמים וכבר מרגישים כפר גלובלי אחד, אבל אין עדיין הרגש של אחריות כלפי האחרים.

בכלל אין, ההיפך. אני חושב שצריכה להתגלות עוד איזו הבנה עד כמה אנחנו כרוכים זה בזה, תלויים זה בזה. ואז למען החיבור האמיתי, למעלה מהמסחר וכל הקשרים האחרים כל אומה תצטרך להרגיש שהאומה האחרת שייכת לה.

תלמיד: היום אנחנו רואים שיש צרה משותפת, נאמר בעיית האקלים, ואף מדינה לא מצליחה לעמוד בהתחייבויות שהיא לקחה על עצמה כלפי מניעת פליטת גזים, זיהום וכל מיני דברים כאלה. כולם מבינים שזאת צרה משותפת, מסכימים שצריך לעשות משהו ולא מצליחים לעמוד בזה.

כן.

תלמיד: אולי הצרה עוד לא מספיק מובנת כגדולה, אבל מה יביא לכזה רצון שבאמת תהיה אחריות הדדית, מה צריך לקרות באנושות?

ודאי שאם כל העמים יגלו את האויב המשותף לכולם זה יעזור להם להתחבר ואז מתוך החיבור שלהם הם יהיו יותר קרובים לבורא ויתגברו על התקלות האלה שהם יראו ביניהם. אבל בינתיים זה עוד רחוק, אנשים עוד לא יכולים לראות את הדברים האלה, בכלל לרצות לראות מהו באמת הדבר שמפריע ביניהם.

תלמיד: אפשר לומר שזה שלב התבגרות שהאנושות תצטרך לעבור?

כן.

תלמיד: כמו ילד, שאתה לא יכול להגיד לו, צא מארגז החול עכשיו.
"""


def run_summarization(t):
    summarizer = pipeline("summarization", model="./summ_he/checkpoint-268")
    summ = summarizer(f"summarize: {t}")
    print(summ)


run_summarization(text)
